app/controllers/api/articles_controller.rb

		def index
        	render json: Article.all
---
SELECT "articles".* FROM "articles"

    	def create
	        @article = Article.create(article_params)
---
INSERT INTO "articles" ("title", "content", "created_at", "updated_at", "author", "image", "likes") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "kkl"], ["content", "n,m"], ["created_at", "2019-02-07 13:30:06.499086"], ["updated_at", "2019-02-07 13:30:06.499086"], ["author", ";lk"], ["image", "k"], ["likes", nil]]

	     def update
	        if @article.update(article_params)
---
UPDATE "articles" SET "created_at" = ?, "likes" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["created_at", "2019-02-05 00:17:49.607000"], ["likes", 1], ["updated_at", "2019-02-05 16:03:00.981226"], ["id", 1]]

		def destroy
			if @article.destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 4]]

			def set_article
				@article = Article.find_by(id: params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]